Repository: vermont42/Konjugieren
Catalog: Konjugieren/Assets/Localizable.xcstrings
Source language: en
Languages: de

# Info.moodText
source: ~Mood~ expresses the speaker's attitude toward the action or some other information about the action not involving tense or voice. Like tense, mood is one component of many conjugationgroups. For example, %PrГӨsens Indikativ% has PrГӨsens tense, implied Aktiv voice, and Indikativ mood. English-speaking German learners might benefit from identification of the English moods, so here they are: рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Indicative~: This mood expresses no attitude and is the default, most widely used mood. Example: "The indicative mood ~expresses~ no attitude." рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Subjunctive~: This mood, largely avoided in informal English, expresses wishes, demands, unreality, or hypotheticality. Examples: "The low temperature necessitates that the skier ~wear~ a hat." "If I ~were~ a humpback whale, I would divide my time between HawaiК»i and Alaska." рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Conditional~: This mood expresses contingency. Example: "In the absence of other constraints, Josh Adams ~would spend~ every waking hour on development of ~Konjugieren~." рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Imperative~: This mood expresses a command. Example: "Let's conjugate some verbs." German mood names differ somewhat from English mood names, but the uses are quite similar. рҹҮ©рҹҮӘ ~Indikativ~: This mood states facts and describes reality, just like English indicative. Example: "Die Katze ~sitzt~ auf der TastaturвҖ”schon wieder." = "The cat ~is sitting~ on the keyboardвҖ”again." рҹҮ©рҹҮӘ ~Konjunktiv I~: This mood is primarily used for indirect speech (~indirekte Rede~)вҖ”reporting what someone else said. Unlike English, which shifts reported speech into past tense, German preserves the original tense but changes the conjugation. Example: Direct: "Ich war das nicht." вҶ’ Indirect: "Das Kind sagte, es ~sei~ das nicht gewesen." = "The child said it ~wasn't~ him." Konjunktiv I appears mainly in journalism and formal writing. When Konjunktiv I conjugations are identical to indicative, which happens in 1s, 1p, and 3p, speakers substitute Konjunktiv II to maintain clarity. рҹҮ©рҹҮӘ ~Konjunktiv II~: This mood expresses hypothetical or contrary-to-fact situations, like English conditional. Example: "Wenn ich unsichtbar ~wГӨre~, ~wГјrde~ ich trotzdem in der Schlange warten." = "If I ~were~ invisible, I ~would~ still wait in line." рҹҮ©рҹҮӘ ~Imperativ~: This mood expresses commands, just like English imperative. Example: "~Iss~ deinen Brokkoli!" = "~Eat~ your broccoli!" Here are the German conjugationgroups arranged by mood: рҹҮ©рҹҮӘ ~Indikativ~: %PrГӨsens Indikativ%, %PrГӨteritum Indikativ%, %Perfekt Indikativ% рҹҮ©рҹҮӘ ~Konjunktiv I~: %PrГӨsens Konjunktiv I%, %Perfekt Konjunktiv I% рҹҮ©рҹҮӘ ~Konjunktiv II~: %PrГӨteritum Konjunktiv II% рҹҮ©рҹҮӘ ~Imperativ~: %Imperativ%
de: ~Modus~ drГјckt die Haltung des Sprechers zur Handlung aus oder andere Informationen Гјber die Handlung, die nicht Tempus oder Genus Verbi betreffen. Wie das Tempus ist der Modus eine Komponente vieler Conjugationgroups. Zum Beispiel hat %PrГӨsens Indikativ% das Tempus PrГӨsens, das implizite Genus Verbi Aktiv und den Modus Indikativ. FГјr Deutschlernende mit englischer Muttersprache kГ¶nnte eine Гңbersicht der englischen Modi hilfreich sein: рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Indicative~: Dieser Modus drГјckt keine besondere Haltung aus und ist der Standard- und am hГӨufigsten verwendete Modus. Beispiel: "The indicative mood ~expresses~ no attitude." рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Subjunctive~: Dieser Modus, der im informellen Englisch weitgehend vermieden wird, drГјckt WГјnsche, Forderungen, IrrealitГӨt oder Hypothetisches aus. Beispiele: "The low temperature necessitates that the skier ~wear~ a hat." "If I ~were~ a humpback whale, I would divide my time between HawaiК»i and Alaska." рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Conditional~: Dieser Modus drГјckt Kontingenz aus. Beispiel: "In the absence of other constraints, Josh Adams ~would spend~ every waking hour on development of ~Konjugieren~." рҹҸҙу Ғ§у Ғўу ҒҘу Ғ®у Ғ§у Ғҝ ~Imperative~: Dieser Modus drГјckt einen Befehl aus. Beispiel: "Let's conjugate some verbs." Die deutschen Modusnamen unterscheiden sich etwas von den englischen, aber die Verwendung ist recht ГӨhnlich. рҹҮ©рҹҮӘ ~Indikativ~: Dieser Modus stellt Tatsachen fest und beschreibt die Wirklichkeit, genau wie der englische "indicative". Beispiel: "Die Katze ~sitzt~ auf der TastaturвҖ”schon wieder." = "The cat ~is sitting~ on the keyboardвҖ”again." рҹҮ©рҹҮӘ ~Konjunktiv I~: Dieser Modus wird hauptsГӨchlich fГјr die indirekte Rede (~indirekte Rede~) verwendet вҖ“ um zu berichten, was jemand anderes gesagt hat. Anders als im Englischen, das die indirekte Rede in die Vergangenheit verschiebt, behГӨlt das Deutsche das ursprГјngliche Tempus bei, ГӨndert aber die Konjugation. Beispiel: Direkt: "Ich war das nicht." вҶ’ Indirekt: "Das Kind sagte, es ~sei~ das nicht gewesen." = "The child said it ~wasn't~ him." Der Konjunktiv I erscheint hauptsГӨchlich im Journalismus und in formeller Schriftsprache. Wenn Konjunktiv-I-Konjugationen mit dem Indikativ identisch sind, was in 1s, 1p und 3p vorkommt, verwenden Sprecher den Konjunktiv II, um Klarheit zu bewahren. рҹҮ©рҹҮӘ ~Konjunktiv II~: Dieser Modus drГјckt hypothetische oder kontrafaktische Situationen aus, wie der englische "conditional". Beispiel: "Wenn ich unsichtbar ~wГӨre~, ~wГјrde~ ich trotzdem in der Schlange warten." = "If I ~were~ invisible, I ~would~ still wait in line." рҹҮ©рҹҮӘ ~Imperativ~: Dieser Modus drГјckt Befehle aus, genau wie der englische "imperative". Beispiel: "~Iss~ deinen Brokkoli!" = "~Eat~ your broccoli!" Hier sind die deutschen Conjugationgroups nach Modus geordnet: рҹҮ©рҹҮӘ ~Indikativ~: %PrГӨsens Indikativ%, %PrГӨteritum Indikativ%, %Perfekt Indikativ% рҹҮ©рҹҮӘ ~Konjunktiv I~: %PrГӨsens Konjunktiv I%, %Perfekt Konjunktiv I% рҹҮ©рҹҮӘ ~Konjunktiv II~: %PrГӨteritum Konjunktiv II% рҹҮ©рҹҮӘ ~Imperativ~: %Imperativ%
